; domain
(define (domain hanoi)

    (:requirements :strips)
    (:predicates (clear ?x) (on ?x ?y) (larger ?x ?y))
    (:action move
        :parameters (?disk ?from ?to)
        :precondition (and (larger ?to ?disk) (on ?disk ?from)
                        (clear ?disk) (clear ?to))
        :effect (and (clear ?from) (on ?disk ?to)
                    (not (on ?disk ?from))
                    (not (clear ?to)))
    )
)

; problem
(define (problem hanoi4)
    (:domain hanoi)
    (:objects peg1 peg2 peg3 d1 d2 d3 d4)
    (:init  (larger peg1 d1) (larger peg1 d2) (larger peg1 d3) (larger peg1 d4)
            (larger peg2 d1) (larger peg2 d2) (larger peg2 d3) (larger peg2 d4)
            (larger peg3 d1) (larger peg3 d2) (larger peg3 d3) (larger peg3 d4)
            (larger d2 d1) (larger d3 d1) (larger d3 d2) 
            (larger d4 d1) (larger d4 d2) (larger d4 d3)
            (clear peg2) (clear peg3) (clear d1)
            (on d4 peg1) (on d3 d4) (on d2 d3) (on d1 d2)
    )
    (:goal (and (on d4 peg3) (on d3 d4) (on d2 d3) (on d1 d2)))
)

; plan
1. (move d1 d2 peg2)
   deleted: (on d1 d2) (clear peg2)
   added: (clear d2) (on d1 peg2)
   goals met: 2 of 4
2. (move d2 d3 peg3)
   deleted: (on d2 d3) (clear peg3)
   added: (clear d3) (on d2 peg3)
   goals met: 1 of 4
3. (move d1 peg2 d2)
   deleted: (on d1 peg2) (clear d2)
   added: (clear peg2) (on d1 d2)
   goals met: 2 of 4
4. (move d3 d4 peg2)
   deleted: (on d3 d4) (clear peg2)
   added: (clear d4) (on d3 peg2)
   goals met: 1 of 4
5. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (clear d2) (on d1 d4)
   goals met: 0 of 4
6. (move d2 peg3 d3)
   deleted: (on d2 peg3) (clear d3)
   added: (clear peg3) (on d2 d3)
   goals met: 1 of 4
7. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (clear d4) (on d1 d2)
   goals met: 2 of 4
8. (move d4 peg1 peg3)
   deleted: (on d4 peg1) (clear peg3)
   added: (clear peg1) (on d4 peg3)
   goals met: 3 of 4
9. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (clear d2) (on d1 d4)
   goals met: 2 of 4
10. (move d2 d3 peg1)
   deleted: (on d2 d3) (clear peg1)
   added: (clear d3) (on d2 peg1)
   goals met: 1 of 4
11. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (clear d4) (on d1 d2)
   goals met: 2 of 4
12. (move d3 peg2 d4)
   deleted: (on d3 peg2) (clear d4)
   added: (clear peg2) (on d3 d4)
   goals met: 3 of 4
13. (move d1 d2 peg2)
   deleted: (on d1 d2) (clear peg2)
   added: (clear d2) (on d1 peg2)
   goals met: 2 of 4
14. (move d2 peg1 d3)
   deleted: (on d2 peg1) (clear d3)
   added: (clear peg1) (on d2 d3)
   goals met: 3 of 4
15. (move d1 peg2 d2)
   deleted: (on d1 peg2) (clear d2)
   added: (clear peg2) (on d1 d2)
   goals met: 4 of 4
